Tekla Open API Reference for Tekla Structures 2025
Operation.ProgressBar.Display Method
 Display progress bar dialog with cancel button. Display will fail if progress bar is already displayed.
 Namespace: Tekla.Structures.Model.Operations
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool Display(
	int SleepTime,
	string Title,
	string Message,
	string CancelButtonLabel,
	string ProgressLabel
)
Public Function Display (
	SleepTime As Integer,
	Title As String,
	Message As String,
	CancelButtonLabel As String,
	ProgressLabel As String
) As Boolean
Parameters
SleepTime
Type: System.Int32
Time (ms) to wait until bar is displayed.
Title
Type: System.String
Title of the dialog.
Message
Type: System.String
Message to be displayed on the dialog above progress bar.
CancelButtonLabel
Type: System.String
Label of cancel button.
ProgressLabel
Type: System.String
Initial progress label (updated with SetProgress). If empty of null no bar exists.
Return Value
Type: Boolean
True if bar was displayed successfully (meaning bar must be closed later).
See Also
Reference
Operation.ProgressBar Class
Tekla.Structures.Model.Operations Namespace